constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    mold_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10493;
        startFace       583576;
    }
    SEN
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25440;
        startFace       594069;
    }
    brass_plates
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8270;
        startFace       619509;
    }
)

// ************************************************************************* //
