system/meshQualityDict
/*---------------------------------------------------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

// 1. GEOMETRIC CHECKS
maxNonOrtho 65;
maxBoundarySkewness 20;
maxInternalSkewness 4;
maxConcave 80;
minVol 1e-13;
minTetQuality 1e-15;
minArea -1;
minTwist 0.05;
minDeterminant 0.001;
minFaceWeight 0.05;
minVolRatio 0.01;
minTriangleTwist -1;

// 2. ERROR REDUCTION (This was missing)
// If the mesh is bad, this controls how much the snapper backs off
nSmoothScale 4;
errorReduction 0.75; 

// 3. RELAXATION
relaxed
{
    maxNonOrtho 75;
}
